InformationRegisters/ПротоколОбменов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПротоколОбменов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗаголовкиЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелоЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелоОтвета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTTPМетод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.HTTPМетод</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСостояния</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IPАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗапроса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОчередьWebHook.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОчередьWebHook</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отправлен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследняяПопытка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Создан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытийWebHooks</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвойсПродажи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>(удалить)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/HTTPМетод.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>HTTPМетод</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>DEL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GET</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PATCH</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>POST</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PUT</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыСобытийWebHooks.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыСобытийWebHooks</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Цена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остаток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатусЗаказа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/УчетныеЗаписиИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиИнтеграции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТокенАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКонтрагентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WebhookURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WebhookАктивен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WebhookToken</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьОстатки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Администратор</Name>
					<Comment> доступны данные всех учетных записей</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПревышениеЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьСнижениеЦенНа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятНаРаботу</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛичнаяИнфо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
					<Comment>Склады, на к-рых сотрудник работает оператором</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/StockAPI_Утилиты/Ext/Module.bsl
// Общие утилиты StockAPI: разбор параметров запроса, пагинация, форматирование ошибок.

// Возвращает строковое значение параметра HTTP-запроса из URL (query string).
// Если передано несколько имён через запятую — перебирает их слева направо
// и возвращает значение первого найденного (алиасы для совместимости API).
//
// Параметры:
//  Запрос        - HTTPСервисЗапрос - входящий запрос StockAPI;
//  ИмяПараметра  - Строка - имя параметра URL или список имён через запятую,
//                   например "orderNumber" или "orderNumber,orderNo,order".
//
// Возвращаемое значение:
//  Строка - значение параметра без крайних пробелов;
//           пустая строка, если параметр отсутствует или не задан ни один из алиасов.
//
Функция СтрокаПараметраЗапроса(Запрос, ИмяПараметра) Экспорт
	
	Разделитель = ",";  
	
	Если СтрНайти(ИмяПараметра, Разделитель) = 0 Тогда
		
		Значение = Запрос.ПараметрыЗапроса.Получить(ИмяПараметра);
		Если Значение = Неопределено Тогда
			Возврат "";
		КонецЕсли;
		Возврат СокрЛП(Строка(Значение));
		
	Иначе  
		
		мас = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяПараметра, Разделитель, Истина);
		Для каждого Параметр Из мас Цикл
			Значение = Запрос.ПараметрыЗапроса.Получить(Параметр);
			Если Значение <> Неопределено Тогда
				Возврат СокрЛП(Строка(Значение));
			КонецЕсли;
		КонецЦикла;
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

// Возвращает значение параметра из тела запроса (Structure/Соответствие) или Неопределено, если не передан.
//
// Параметры:
//  ДанныеЗапроса - Структура, Соответствие, Неопределено - данные HTTP-запроса;
//  ИмяПараметра  - Строка - имя параметра.
//
// Возвращаемое значение:
//  Произвольный, Неопределено - значение параметра; Неопределено, если параметр отсутствует.
//
Функция ЗначениеПараметраДанныхЗапроса(ДанныеЗапроса, ИмяПараметра) Экспорт
	
	Если ДанныеЗапроса = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТипДанных = ТипЗнч(ДанныеЗапроса);
	Если ТипДанных = Тип("Структура") Или ТипДанных = Тип("ФиксированнаяСтруктура") Тогда
		Значение = Неопределено;
		Если ДанныеЗапроса.Свойство(ИмяПараметра, Значение) Тогда
			Возврат Значение;
		КонецЕсли;
	ИначеЕсли ТипДанных = Тип("Соответствие") Тогда
		Для Каждого КлючИЗначение Из ДанныеЗапроса Цикл
			Если КлючИЗначение.Ключ = ИмяПараметра Тогда
				Возврат КлючИЗначение.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает булево значение параметра запроса или Неопределено, если параметр не передан.
//
// Параметры:
//  ДанныеЗапроса - Структура, Соответствие, Неопределено - данные HTTP-запроса;
//  ИмяПараметра  - Строка - имя параметра (blocked, canceled, readyToShip и т.п.).
//
// Возвращаемое значение:
//  Булево, Неопределено - значение параметра; Неопределено, если параметр отсутствует.
//
Функция БулевоПараметраЗапроса(ДанныеЗапроса, ИмяПараметра) Экспорт
	
	Значение = ЗначениеПараметраДанныхЗапроса(ДанныеЗапроса, ИмяПараметра);
	Если Значение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Булево") Тогда
		Возврат Значение;
	КонецЕсли;
	
	СтрокаЗнач = НРег(СокрЛП(Строка(Значение)));
	Если СтрокаЗнач = "true"
		Или СтрокаЗнач = "1"
		Или СтрокаЗнач = "yes" Тогда
		Возврат Истина;
	ИначеЕсли СтрокаЗнач = "false"
		Или СтрокаЗнач = "0"
		Или СтрокаЗнач = "no" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Значение = Истина;
	
КонецФункции

// Дополняет структуру тела запроса параметрами URL (тело имеет приоритет).
//
Процедура ДополнитьДанныеЗапросаПараметрамиURL(ДанныеЗапроса, Запрос, ИменаПараметров) Экспорт
	
	Если ДанныеЗапроса = Неопределено Тогда
		ДанныеЗапроса = Новый Структура;
	КонецЕсли;
	
	Имена = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаПараметров, ",", Истина);
	Для Каждого ИмяПараметра Из Имена Цикл
		Если ЗначениеПараметраДанныхЗапроса(ДанныеЗапроса, ИмяПараметра) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗначениеПараметра = СтрокаПараметраЗапроса(Запрос, ИмяПараметра);
		Если ЗначениеПараметра <> "" Тогда
			ДанныеЗапроса.Вставить(ИмяПараметра, ЗначениеПараметра);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СвойствоДанныхЗапроса(ДанныеЗапроса, ИмяСвойства, ЗначениеКогдаНеНайдено = "") Экспорт
	
	Разделитель = ",";  
	
	Если СтрНайти(ИмяСвойства, Разделитель) = 0 Тогда
		
		Если ДанныеЗапроса.Свойство(ИмяСвойства) Тогда
		    Возврат ДанныеЗапроса[ИмяСвойства]; 
		Иначе
			Возврат ЗначениеКогдаНеНайдено;
		КонецЕсли;
		
	Иначе  
		
		мас = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяСвойства, Разделитель, Истина);
		Для каждого Имя Из мас Цикл
			Если ДанныеЗапроса.Свойство(Имя) Тогда
				Возврат ДанныеЗапроса[Имя];
			КонецЕсли;
		КонецЦикла;
		Возврат ЗначениеКогдаНеНайдено;
		
	КонецЕсли;
	
КонецФункции

Функция ДатаПараметраЗапроса(Запрос, ИмяПараметра) Экспорт
	
	Разделитель = ",";  

	Если СтрНайти(ИмяПараметра, Разделитель) = 0 Тогда 
		
		СтрокаДаты = СтрокаПараметраЗапроса(Запрос, ИмяПараметра);
		Возврат СтрокаВДату(СтрокаДаты);
		
	Иначе
		
		мас = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяПараметра, Разделитель ,Истина);
		Для каждого Параметр Из мас Цикл
			СтрокаДаты = Запрос.ПараметрыЗапроса.Получить(Параметр);
			Если СтрокаДаты <> Неопределено Тогда
				Возврат СтрокаВДату(СтрокаДаты);
			КонецЕсли;
		КонецЦикла;
		Возврат "";

	КонецЕсли;
	
КонецФункции

Функция ЦелоеПараметраЗапроса(СтрокаЗначения, ЗначениеПоУмолчанию) Экспорт
	
	Если СтрокаЗначения = Неопределено Или СокрЛП(СтрокаЗначения) = "" Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Попытка
		ЧислоЗначения = Число(СтрокаЗначения);
	Исключение
		Возврат -1;
	КонецПопытки;
	
	Если ЧислоЗначения <> Цел(ЧислоЗначения) Тогда
		Возврат -1;
	КонецЕсли;
	
	Возврат Цел(ЧислоЗначения);
	
КонецФункции

Функция ВсегоСтраницПагинации(ВсегоЭлементов, РазмерСтраницы) Экспорт
	
	Если ВсегоЭлементов = 0 Или РазмерСтраницы <= 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат Цел((ВсегоЭлементов - 1) / РазмерСтраницы) + 1;
	
КонецФункции

// Разбор параметров пагинации: page (с 1), pageSize/limit (макс. 500). 
//
Функция ПараметрыПагинацииОстатков(Запрос) Экспорт
	
	МаксРазмерСтраницы = 500;
	РазмерПоУмолчанию = 500;
	Результат = Новый Структура("page, pageSize, Ошибка", 1, РазмерПоУмолчанию, "");
	
	СтрокаСтраницы = Запрос.ПараметрыЗапроса.Получить("page");
	СтрокаРазмера = Запрос.ПараметрыЗапроса.Получить("pageSize");
	Если СтрокаРазмера = Неопределено Или СокрЛП(СтрокаРазмера) = "" Тогда
		СтрокаРазмера = Запрос.ПараметрыЗапроса.Получить("limit");
	КонецЕсли;
	
	НомерСтраницы = ЦелоеПараметраЗапроса(СтрокаСтраницы, 1);
	Если НомерСтраницы < 0 Тогда
		Результат.Ошибка = "Параметр page должен быть целым числом >= 1.";
		Возврат Результат;
	КонецЕсли;
	Если НомерСтраницы = 0 Тогда
		НомерСтраницы = 1;
	КонецЕсли;
	
	РазмерСтраницы = ЦелоеПараметраЗапроса(СтрокаРазмера, РазмерПоУмолчанию);
	Если РазмерСтраницы < 0 Тогда
		Результат.Ошибка = "Параметр pageSize (или limit) должен быть целым числом от 1 до 500.";
		Возврат Результат;
	КонецЕсли;
	Если РазмерСтраницы = 0 Тогда
		РазмерСтраницы = РазмерПоУмолчанию;
	КонецЕсли;
	Если РазмерСтраницы > МаксРазмерСтраницы Тогда
		Результат.Ошибка = СтрШаблон("pageSize не может превышать %1.", МаксРазмерСтраницы);
		Возврат Результат;
	КонецЕсли;
	
	Результат.page = НомерСтраницы;
	Результат.pageSize = РазмерСтраницы;
	Возврат Результат;
	
КонецФункции

// Собирает все строки из СписокЗначений или Массива в одну строку с переносами.
//
Функция ТекстОшибокСписка(Ошибки) Экспорт
	
	Текст = "";
	Для Каждого Ошибка Из Ошибки Цикл
		Если ТипЗнч(Ошибка) = тип("Строка") Тогда
			Текст = Текст + Ошибка + Символы.ПС;
		Иначе
			Текст = Текст + Ошибка.Значение + Символы.ПС;
		КонецЕсли;
	КонецЦикла;
	Возврат СокрЛП(Текст);
	
КонецФункции

// serials=with|without. ПоУмолчаниюССериями — если параметр не передан.       
//
Функция ПараметрSerialsЗапроса(Запрос, ПоУмолчаниюССериями = Истина) Экспорт
	
	Результат = Новый Структура("ССериями, Ошибка", ПоУмолчаниюССериями, "");
	СтрокаПараметра = НРег(СтрокаПараметраЗапроса(Запрос, "serials"));
	Если СтрокаПараметра = "" Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если СтрокаПараметра = "with"
		Или СтрокаПараметра = "true"
		Или СтрокаПараметра = "1"
		Или СтрокаПараметра = "yes" Тогда
		Результат.ССериями = Истина;
	ИначеЕсли СтрокаПараметра = "without"
		Или СтрокаПараметра = "false"
		Или СтрокаПараметра = "0"
		Или СтрокаПараметра = "no" Тогда
		Результат.ССериями = Ложь;
	Иначе
		Результат.Ошибка = "Неподдерживаемый serials. Допустимые значения: with, without (или true, false).";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


// © Primus1C  15.06.2026  НАЧАЛО ►

// Возвращает криптографически стойкий хеш SHA-256 (строка 64 символа в нижнем регистре)   
//
Функция СгенерироватьТокенSHA256() Экспорт
	
	// 1. Формируем уникальную исходную строку (соль)
	// Комбинация GUID и времени до миллисекунд исключает совпадения даже теоретически
	УникальнаяСтрока = Строка(Новый УникальныйИдентификатор) 
	                 + Строка(ТекущаяУниверсальнаяДатаВМиллисекундах());
	
	// 2. Инициализируем объект хеширования алгоритмом SHA-256
	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA256);
	
	// 3. Вычисляем хеш для нашей строки
	Хеширование.Добавить(УникальнаяСтрока);
	
	// 4. Получаем результат в виде двоичных данных
	ДвоичныеДанныеХеша = Хеширование.ХешСумма;
	
	// 5. Конвертируем в шестнадцатеричную строку (Hex)
	СтрокаHex = НРег(ПолучитьHexСтрокуИзДвоичныхДанных(ДвоичныеДанныеХеша));
	
	Возврат СтрокаHex;
	
КонецФункции

Функция ПроверитьКлючAPI(ЗапросАПИ, КонтекстАвторизации) Экспорт
	
	// Ожидаем, что клиент присылает ключ в заголовке X-Api-Key
	КлючКлиента = ЗапросАПИ.Заголовки.Получить("X-Api-Key");

	Если Не ЗначениеЗаполнено(КлючКлиента) Тогда
		КонтекстАвторизации.Вставить("Ошибка", "Отсутствует заголовок ключа.");
		Возврат Ложь;
	КонецЕсли;
	
	ЗапросБД = Новый Запрос;
	ЗапросБД.Текст = "ВЫБРАТЬ
	                 |	УчЗаписи.Ссылка КАК УчетнаяЗапись,
	                 |	УчЗаписи.Активен КАК Активен,
	                 |	УчЗаписи.Администратор КАК Администратор
	                 |ИЗ
	                 |	Справочник.УчетныеЗаписиИнтеграции КАК УчЗаписи
	                 |ГДЕ
	                 |	УчЗаписи.ТокенАвторизации = &КлючAPI";
		
	ЗапросБД.УстановитьПараметр("КлючAPI", КлючКлиента);
	Выборка = ЗапросБД.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Если Выборка.Активен Тогда
			КонтекстАвторизации.Вставить("УчетнаяЗапись", Выборка.УчетнаяЗапись);
			КонтекстАвторизации.Вставить("Администратор", Выборка.Администратор = Истина);
			Возврат Истина; 
		Иначе
			КонтекстАвторизации.Вставить("Ошибка", "Учетная запись отключена.");
			Возврат Ложь;
		КонецЕсли;
	Иначе 
		КонтекстАвторизации.Вставить("Ошибка", "Ошибка авторизации: неверный логин или пароль.");
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Признак «Администратор» учётной записи API.
//
// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиИнтеграции - учётная запись из авторизации.
//
// Возвращаемое значение:
//  Булево - Истина, если у записи включён реквизит Администратор.
//
Функция ЭтоАдминистраторAPI(УчетнаяЗапись) Экспорт
	
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат УчетнаяЗапись.Администратор = Истина;
	
КонецФункции

// Число активных (не помеченных на удаление) учётных записей интеграции.
//
Функция КоличествоАктивныхУчетныхЗаписейИнтеграции() Экспорт
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	КОЛИЧЕСТВО(УЗ.Ссылка) КАК Количество
	             |ИЗ
	             |	Справочник.УчетныеЗаписиИнтеграции КАК УЗ
	             |ГДЕ
	             |	УЗ.Активен
	             |	И НЕ УЗ.ПометкаУдаления";
	Выборка = Запр.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	КонецЕсли;
	Возврат 0;
	
КонецФункции

// Склады, входящие в ТЧ «Склады» всех активных учётных записей (пересечение).
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.Склады.
//
Функция СкладыОбщиеДляВсехУчетныхЗаписейAPI() Экспорт
	
	КоличествоУЗ = КоличествоАктивныхУчетныхЗаписейИнтеграции();
	Если КоличествоУЗ = 0 Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("КоличествоУЗ", КоличествоУЗ);
	Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	СкладыУЗ.Склад КАК Склад
	             |ИЗ
	             |	Справочник.УчетныеЗаписиИнтеграции.Склады КАК СкладыУЗ
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчетныеЗаписиИнтеграции КАК УЗ
	             |		ПО СкладыУЗ.Ссылка = УЗ.Ссылка
	             |ГДЕ
	             |	УЗ.Активен
	             |	И НЕ УЗ.ПометкаУдаления
	             |	И НЕ СкладыУЗ.Склад.ПометкаУдаления
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	СкладыУЗ.Склад
	             |
	             |ИМЕЮЩИЕ
	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СкладыУЗ.Ссылка) = &КоличествоУЗ";
	
	Возврат Запр.Выполнить().Выгрузить().ВыгрузитьКолонку("Склад");
	
КонецФункции

// Контрагенты, входящие в группу контрагентов каждой активной учётной записи (пересечение иерархий).
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.Контрагенты.
//
Функция КонтрагентыОбщиеДляВсехУчетныхЗаписейAPI() Экспорт
	
		Запр = Новый Запрос;
		Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		                   |	Контрагенты.Ссылка КАК Ссылка
		                   |ИЗ
		                   |	Справочник.Контрагенты КАК Контрагенты
		                   |ГДЕ
		                   |	НЕ Контрагенты.ЭтоГруппа
		                   |	И НЕ Контрагенты.ПометкаУдаления
		                   |	И Контрагенты.Ссылка В ИЕРАРХИИ
		                   |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		                   |				УЗ.ГруппаКонтрагентов КАК Группа
		                   |			ИЗ
		                   |				Справочник.УчетныеЗаписиИнтеграции КАК УЗ
		                   |			ГДЕ
		                   |				УЗ.Активен
		                   |				И НЕ УЗ.ПометкаУдаления
		                   |				И УЗ.ГруппаКонтрагентов <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))";
	РезультатЗапроса = Запр.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Массив;	
	Иначе
	    Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);
	КонецЕсли;
	
КонецФункции

// Сотрудники, доступные каждой активной учётной записи (есть общий склад с ТЧ каждой записи).
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.Сотрудники.
//
Функция СотрудникиОбщиеДляВсехУчетныхЗаписейAPI() Экспорт
	
	КоличествоУЗ = КоличествоАктивныхУчетныхЗаписейИнтеграции();
	Если КоличествоУЗ = 0 Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("КоличествоУЗ", КоличествоУЗ);
	Запр.УстановитьПараметр("ПустаяДата", Дата(1, 1, 1));
	Запр.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	Запр.Текст = "ВЫБРАТЬ
	             |	СотрудникиСклады.Ссылка КАК Сотрудник
	             |ИЗ
	             |	Справочник.Сотрудники.Склады КАК СотрудникиСклады
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	             |		ПО СотрудникиСклады.Ссылка = Сотрудники.Ссылка
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчетныеЗаписиИнтеграции.Склады КАК СкладыУЗ
	             |		ПО СотрудникиСклады.Склад = СкладыУЗ.Склад
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчетныеЗаписиИнтеграции КАК УЗ
	             |		ПО (СкладыУЗ.Ссылка = УЗ.Ссылка)
	             |ГДЕ
	             |	УЗ.Активен
	             |	И НЕ УЗ.ПометкаУдаления
	             |	И НЕ Сотрудники.ЭтоГруппа
	             |	И НЕ Сотрудники.ПометкаУдаления
	             |	И (Сотрудники.ДатаУвольнения = &ПустаяДата
	             |			ИЛИ Сотрудники.ДатаУвольнения >= &ТекущаяДата)
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	СотрудникиСклады.Ссылка
	             |
	             |ИМЕЮЩИЕ
	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СкладыУЗ.Ссылка) = &КоличествоУЗ";
	
	Возврат Запр.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
КонецФункции

//Функция ПересечениеМассивовСсылок(Массив1, Массив2)
//	
//	Результат = Новый Массив;
//	Если Массив1.Количество() = 0 Или Массив2.Количество() = 0 Тогда
//		Возврат Результат;
//	КонецЕсли;
//	
//	Набор2 = Новый Соответствие;
//	Для Каждого Элемент Из Массив2 Цикл
//		Набор2.Вставить(Элемент, Истина);
//	КонецЦикла;
//	
//	Для Каждого Элемент Из Массив1 Цикл
//		Если Набор2.Получить(Элемент) <> Неопределено Тогда
//			Результат.Добавить(Элемент);
//		КонецЕсли;
//	КонецЦикла;
//	
//	Возврат Результат;
//	
//КонецФункции

//
//
Функция КодВСтроку(Код) Экспорт
	
	Если ЗначениеЗаполнено(Код) Тогда 
		Возврат Формат(Код, "ЧГ=0");
	Иначе	
		Возврат "";
	КонецЕсли;
	
КонецФункции

//
//
Функция ДатаВСтроку(Дата) Экспорт

	Возврат Формат(Дата, "ДФ=yyyy-MM-ddTHH:mm:ss");	

КонецФункции // ()

// Преобразует строку формата yyyy-MM-dd (допускается суффикс времени yyyy-MM-ddTHH:mm:ss) в дату.
// Пустая или некорректная строка — Неопределено. 
//
Функция СтрокаВДату(СтрокаДаты) Экспорт
	
	СтрокаДаты = СокрЛП(СтрокаДаты);
	Если СтрокаДаты = "" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если СтрДлина(СтрокаДаты) >= 10 Тогда
		СтрокаДаты = Лев(СтрокаДаты, 10);
	КонецЕсли;
	
	Части = СтрРазделить(СтрокаДаты, "-", Ложь);
	Если Части.Количество() <> 3 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Возврат Дата(Число(Части[0]), Число(Части[1]), Число(Части[2]));
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

//
//
Процедура ЗаписатьВПротокол(Запрос, Ответ, ПользовательИнтеграции, ДлительностьМс, ТекстОшибкиВнутр = "", ТелоЗапроса = Неопределено, ТелоОтвета = Неопределено) Экспорт
	
	Попытка
		МЗ = РегистрыСведений.ПротоколОбменов.СоздатьМенеджерЗаписи();
		
		// Измерения и базовые реквизиты
		МЗ.ИдентификаторЗапроса = Новый УникальныйИдентификатор;
		МЗ.Дата 			= ТекущаяДатаСеанса();
		МЗ.ИмяСервиса 		= "StockAPI";
		
		//МЗ.ШаблонURL = Запрос.ШаблонURL;  
		Попытка
			МЗ.ШаблонURL 	= Лев(Запрос.ОтносительныйURL, 50);
		Исключение
			МЗ.ШаблонURL 	= "";
		КонецПопытки;

		Попытка
			// Запись перечисления (GET, POST и т.д.)
			МЗ.HTTPМетод 	= Перечисления.HTTPМетод[Запрос.HTTPМетод];
		Исключение
		КонецПопытки;
		
		МЗ.КодСостояния 	= Ответ.КодСостояния;
		МЗ.Длительность 	= ДлительностьМс;
		МЗ.Пользователь 	= ПользовательИнтеграции;
		МЗ.ТекстОшибки 		= Лев(ТекстОшибкиВнутр, 200);
		
		// Определение IP адреса
		IP = Запрос.Заголовки.Получить("X-Forwarded-For");
		Если IP = Неопределено Тогда
			IP = Запрос.Заголовки.Получить("Remote-Addr");
		КонецЕсли;
		МЗ.IPАдрес 			= ?(IP = Неопределено, "", Лев(IP, 50));
		
		// Запись ресурсов (ХранилищеЗначения)
		МЗ.ЗаголовкиЗапроса = Новый ХранилищеЗначения(СтруктураВJSON(Запрос.Заголовки), Новый СжатиеДанных(9));
		МЗ.ТелоЗапроса 		= Новый ХранилищеЗначения(ТелоHTTPЗапросаДляПротокола(Запрос, ТелоЗапроса), Новый СжатиеДанных(9));
		МЗ.ТелоОтвета 		= Новый ХранилищеЗначения(ТелоHTTPОтветаДляПротокола(Ответ, ТелоОтвета), Новый СжатиеДанных(9));
		
		МЗ.Записать();
	Исключение
		// Ошибка записи лога не должна ронять сам API
		ЗаписьЖурналаРегистрации("StockAPI.Протоколирование", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

//
//
Функция ТелоHTTPЗапросаДляПротокола(Запрос, ТелоЗапроса = Неопределено)
	
	Если ТипЗнч(ТелоЗапроса) = Тип("Строка") Тогда
		Возврат ТелоЗапроса;
	КонецЕсли;
	
	Попытка
		Возврат Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	Исключение
		Попытка
			Возврат Запрос.ПолучитьТелоКакСтроку();
		Исключение
			Возврат "";
		КонецПопытки;
	КонецПопытки;
	
КонецФункции

//
//
Функция ТелоHTTPОтветаДляПротокола(Ответ, ТелоОтвета = Неопределено)
	
	Если ТипЗнч(ТелоОтвета) = Тип("Строка") Тогда
		Возврат ТелоОтвета;
	КонецЕсли;
	
	Попытка
		Возврат Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	Исключение
		Попытка
			Возврат Ответ.ПолучитьТелоКакСтроку();
		Исключение
		КонецПопытки;
	КонецПопытки;
	
	Попытка
		ДвоичныеДанные = Ответ.ПолучитьТелоКакДвоичныеДанные();
		Если ДвоичныеДанные = Неопределено Тогда
			Возврат "";
		КонецЕсли;
		
		Размер = ДвоичныеДанные.Размер();
		Если Размер = 0 Тогда
			Возврат "";
		КонецЕсли;
		
		ContentType = Ответ.Заголовки.Получить("Content-Type");
		Если ContentType = Неопределено Тогда
			ContentType = "";
		КонецЕсли;
		
		Возврат СтрШаблон("<binary body, %1 bytes, Content-Type: %2>", Размер, ContentType);
	Исключение
		Возврат "";
	КонецПопытки;
	
КонецФункции


#Область ВебХуки  

Процедура ОтправкаWebHook() Экспорт
	
	Попытка
		ОтправитьОчередьWebHook();
	Исключение
		ЗаписьЖурналаРегистрации("StockAPI.WebHook", УровеньЖурналаРегистрации.Ошибка,,,
			"Ошибка регламентной отправки web hook: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ОтправитьОчередьWebHook(МаксимумЗаписей = 100) Экспорт
	
	Если МаксимумЗаписей <= 0 Тогда
		МаксимумЗаписей = 100;
	КонецЕсли;
	
	Расписание = РасписаниеПовторовWebHook();
	ТекущаяДата = ТекущаяДатаСеанса();
	ПустаяДата = Дата(1, 1, 1);
	ЛимитВыборки = МаксимумЗаписей * 500;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустаяДата", ПустаяДата);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ " + Формат(ЛимитВыборки, "ЧГ=0") + "
	               |	ОчередьWebHook.ИД КАК ИД,
	               |	ОчередьWebHook.УчетнаяЗапись КАК УчетнаяЗапись,
	               |	ОчередьWebHook.ТипСобытия КАК ТипСобытия,
	               |	ОчередьWebHook.Номенклатура КАК Номенклатура,
	               |	ОчередьWebHook.Склад КАК Склад,
	               |	ОчередьWebHook.ВидЦены КАК ВидЦены,
	               |	ОчередьWebHook.Заказ КАК Заказ,
	               |	ОчередьWebHook.Отправлен КАК Отправлен,
	               |	ОчередьWebHook.Создан КАК Создан,
	               |	ОчередьWebHook.Ошибка КАК Ошибка,
	               |	ОчередьWebHook.Инициатор КАК Инициатор,
	               |	ОчередьWebHook.КоличествоПопыток КАК КоличествоПопыток,
	               |	ОчередьWebHook.ПоследняяПопытка КАК ПоследняяПопытка,
	               |	ОчередьWebHook.УчетнаяЗапись.WebhookURL КАК WebhookURL,
	               |	ОчередьWebHook.УчетнаяЗапись.WebhookToken КАК WebhookToken
	               |ИЗ
	               |	РегистрСведений.ОчередьWebHook КАК ОчередьWebHook
	               |ГДЕ
	               |	ОчередьWebHook.Отправлен = &ПустаяДата
				   |	И ОчередьWebHook.УчетнаяЗапись.Активен
				   |	И ОчередьWebHook.УчетнаяЗапись.WebhookАктивен
				   |	И ОчередьWebHook.УчетнаяЗапись.WebhookURL <> """"
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОчередьWebHook.Создан,
	               |	ОчередьWebHook.ИД";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пакеты = СформироватьПакетыWebHook(Выборка, Расписание, ТекущаяДата, ПустаяДата);
	ОтправленоПакетов = 0;
	
	Для Каждого Пакет Из Пакеты Цикл
		
		Если ОтправленоПакетов >= МаксимумЗаписей Тогда
			Прервать;
		КонецЕсли;
		
		ДатаПопытки = ТекущаяДатаСеанса();
		ТекстОшибки = "";
		Отправлено = Ложь;
		
		Попытка
			ТелоJSON = СтруктураВJSON(ТелоПакетаWebHook(Пакет));
			ОтветHTTP = ОтправитьPOSTWebHook(Пакет.WebhookURL, ТелоJSON, Пакет.WebhookToken);
			Отправлено = ОтветHTTP.КодСостояния >= 200 И ОтветHTTP.КодСостояния < 300;
			Если НЕ Отправлено Тогда
				ТекстОшибки = СтрШаблон("HTTP %1: %2", ОтветHTTP.КодСостояния, ОтветHTTP.ТелоОтвета);
			КонецЕсли;
		Исключение
			ТекстОшибки = ОписаниеОшибки();
		КонецПопытки;
		
		ЗаписатьРезультатОтправкиПакетаWebHook(Пакет.Строки, ДатаПопытки, Отправлено, ТекстОшибки);
		ОтправленоПакетов = ОтправленоПакетов + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Функция РасписаниеПовторовWebHook()
	
	СтрокаРасписания = Константы.ПериодичностьОповещенийИнтеграции.Получить();
	Результат = Новый Массив;
	
	Если Не ЗначениеЗаполнено(СтрокаРасписания) Тогда
		СтрокаРасписания = "30, 30, 30, 60, 60, 300, 600, 3600";
	КонецЕсли;
	
	Части = СтрРазделить(СтрокаРасписания, ",", Ложь);
	Для Каждого Часть Из Части Цикл
		
		Попытка
			Интервал = Цел(Число(СокрЛП(Часть)));
		Исключение
			Интервал = 0;
		КонецПопытки;
		
		Если Интервал > 0 Тогда
			Результат.Добавить(Интервал);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Результат.Количество() = 0 Тогда
		Результат.Добавить(30);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИнтервалПовтораWebHook(КоличествоПопыток, Расписание)
	
	Если КоличествоПопыток <= 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Индекс = КоличествоПопыток;
	Если Индекс > Расписание.Количество() Тогда
		Индекс = Расписание.Количество();
	КонецЕсли;
	
	Возврат Расписание[Индекс - 1];
	
КонецФункции

Функция ЗаписьWebHookГотоваКОтправке(СтрокаОчереди, Расписание, ТекущаяДата, ПустаяДата)
	
	Если СтрокаОчереди.КоличествоПопыток = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если СтрокаОчереди.ПоследняяПопытка = ПустаяДата Тогда
		Возврат Истина;
	КонецЕсли;
	
	ИнтервалСекунд = ИнтервалПовтораWebHook(СтрокаОчереди.КоличествоПопыток, Расписание);
	СледующаяПопытка = СтрокаОчереди.ПоследняяПопытка + ИнтервалСекунд / 86400;
	
	Возврат СледующаяПопытка <= ТекущаяДата;
	
КонецФункции

Функция МаксимумЭлементовВПакетеWebHook()
	
	Возврат 200;
	
КонецФункции

Функция КлючПакетаWebHook(СтрокаОчереди)
	
	Возврат Строка(СтрокаОчереди.УчетнаяЗапись) + "|" + Строка(СтрокаОчереди.ТипСобытия);
	
КонецФункции

Функция СформироватьПакетыWebHook(Выборка, Расписание, ТекущаяДата, ПустаяДата)
	
	ПакетыПоКлючу = Новый Соответствие;
	Пакеты = Новый Массив;
	МаксимумЭлементов = МаксимумЭлементовВПакетеWebHook();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗаписьWebHookГотоваКОтправке(Выборка, Расписание, ТекущаяДата, ПустаяДата) Тогда
			Продолжить;
		КонецЕсли;
		
		Ключ = КлючПакетаWebHook(Выборка);
		Пакет = ПакетыПоКлючу.Получить(Ключ);
		
		Если Пакет = Неопределено Или Пакет.Строки.Количество() >= МаксимумЭлементов Тогда
			Пакет = Новый Структура("УчетнаяЗапись,ТипСобытия,WebhookURL,WebhookToken,Строки,МинСоздан",
				Выборка.УчетнаяЗапись, Выборка.ТипСобытия, Выборка.WebhookURL, Выборка.WebhookToken, Новый Массив, Выборка.Создан);
			Пакеты.Добавить(Пакет);
			ПакетыПоКлючу.Вставить(Ключ, Пакет);
		КонецЕсли;
		
		Пакет.Строки.Добавить(СтрокаОчередиWebHookИзВыборки(Выборка));
		
		Если Выборка.Создан < Пакет.МинСоздан Тогда
			Пакет.МинСоздан = Выборка.Создан;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Пакеты;
	
КонецФункции

Функция СтрокаОчередиWebHookИзВыборки(Выборка)
	
	Возврат Новый Структура(
		"ИД,УчетнаяЗапись,ТипСобытия,Номенклатура,Склад,ВидЦены,Заказ,Отправлен,Создан,Ошибка,Инициатор,КоличествоПопыток,ПоследняяПопытка",
		Выборка.ИД, Выборка.УчетнаяЗапись, Выборка.ТипСобытия, Выборка.Номенклатура, Выборка.Склад, Выборка.ВидЦены, Выборка.Заказ,
		Выборка.Отправлен, Выборка.Создан, Выборка.Ошибка, Выборка.Инициатор, Выборка.КоличествоПопыток, Выборка.ПоследняяПопытка);
	
КонецФункции

Функция ТелоПакетаWebHook(Пакет)
	
	Тело = Новый Структура;
	Тело.Вставить("batchId", Строка(Новый УникальныйИдентификатор));
	Тело.Вставить("eventType", Строка(Пакет.ТипСобытия));
	Тело.Вставить("createdAt", ДатаВСтроку(Пакет.МинСоздан));
	
	ДанныеОбогащения = ДанныеОбогащенияWebHook(Пакет.ТипСобытия, Пакет.Строки);
	МассивЭлементов = Новый Массив;
	
	Для Каждого СтрокаОчереди Из Пакет.Строки Цикл
		МассивЭлементов.Добавить(ЭлементСообщенияWebHook(СтрокаОчереди, Пакет.ТипСобытия, ДанныеОбогащения));
	КонецЦикла;
	
	Тело.Вставить("items", МассивЭлементов);
	
	Возврат Тело;
	
КонецФункции

Функция ДанныеОбогащенияWebHook(ТипСобытия, СтрокиПакета)
	
	Если ТипСобытия = Перечисления.ТипыСобытийWebHooks.Остаток Тогда
		Возврат ЗагрузитьОстаткиДляWebHook(СтрокиПакета);
	ИначеЕсли ТипСобытия = Перечисления.ТипыСобытийWebHooks.Цена Тогда
		Возврат ЗагрузитьЦеныДляWebHook(СтрокиПакета);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция КлючТовараWebHook(Номенклатура, Склад, ВидЦены = Неопределено)
	
	Ключ = Строка(Номенклатура) + "|" + Строка(Склад);
	Если ЗначениеЗаполнено(ВидЦены) Тогда
		Ключ = Ключ + "|" + Строка(ВидЦены);
	КонецЕсли;
	
	Возврат Ключ;
	
КонецФункции

Функция ЗагрузитьОстаткиДляWebHook(СтрокиПакета)
	
	Результат = Новый Соответствие;
	ТаблицаКлючей = Новый ТаблицаЗначений;
	ТаблицаКлючей.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаКлючей.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ДобавленныеКлючи = Новый Соответствие;
	
	Для Каждого СтрокаОчереди Из СтрокиПакета Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаОчереди.Номенклатура) Или НЕ ЗначениеЗаполнено(СтрокаОчереди.Склад) Тогда
			Продолжить;
		КонецЕсли;
		
		Ключ = КлючТовараWebHook(СтрокаОчереди.Номенклатура, СтрокаОчереди.Склад);
		Если ДобавленныеКлючи.Получить(Ключ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавленныеКлючи.Вставить(Ключ, Истина);
		НоваяСтрока = ТаблицаКлючей.Добавить();
		НоваяСтрока.Номенклатура = СтрокаОчереди.Номенклатура;
		НоваяСтрока.Склад = СтрокаОчереди.Склад;
		
	КонецЦикла;
	
	Если ТаблицаКлючей.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ключи", ТаблицаКлючей);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Ключи.Номенклатура КАК Номенклатура,
	               |	Ключи.Склад КАК Склад
	               |ПОМЕСТИТЬ Ключи
	               |ИЗ
	               |	&Ключи КАК Ключи
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Ключи.Номенклатура КАК Номенклатура,
	               |	Ключи.Склад КАК Склад,
	               |	ЕСТЬNULL(Ост.ОстатокОстаток, 0) КАК Остаток,
	               |	ЕСТЬNULL(Ост.РезервОстаток, 0) КАК Резерв
	               |ИЗ
	               |	Ключи КАК Ключи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовара.Остатки(, ) КАК Ост
	               |		ПО Ключи.Номенклатура = Ост.Номенклатура
	               |			И Ключи.Склад = Ост.Склад";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Данные = Новый Структура("balance,reserve", КодВСтроку(Выборка.Остаток), КодВСтроку(Выборка.Резерв));
		Результат.Вставить(КлючТовараWebHook(Выборка.Номенклатура, Выборка.Склад), Данные);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьЦеныДляWebHook(СтрокиПакета)
	
	Результат = Новый Соответствие;
	Группы = Новый Соответствие;
	
	Для Каждого СтрокаОчереди Из СтрокиПакета Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаОчереди.Номенклатура)
			Или НЕ ЗначениеЗаполнено(СтрокаОчереди.Склад)
			Или НЕ ЗначениеЗаполнено(СтрокаОчереди.ВидЦены) Тогда
			Продолжить;
		КонецЕсли;
		
		КлючГруппы = Строка(СтрокаОчереди.Склад) + "|" + Строка(СтрокаОчереди.ВидЦены);
		МассивНоменклатуры = Группы.Получить(КлючГруппы);
		
		Если МассивНоменклатуры = Неопределено Тогда
			МассивНоменклатуры = Новый Массив;
			Группы.Вставить(КлючГруппы, МассивНоменклатуры);
		КонецЕсли;
		
		Если МассивНоменклатуры.Найти(СтрокаОчереди.Номенклатура) = Неопределено Тогда
			МассивНоменклатуры.Добавить(СтрокаОчереди.Номенклатура);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из Группы Цикл
		
		Склад = Неопределено;
		ВидЦены = Неопределено;
		Для Каждого СтрокаОчереди Из СтрокиПакета Цикл
			Если КлючТовараWebHook(СтрокаОчереди.Номенклатура, СтрокаОчереди.Склад, СтрокаОчереди.ВидЦены) <> "" 
				И Строка(СтрокаОчереди.Склад) + "|" + Строка(СтрокаОчереди.ВидЦены) = КлючИЗначение.Ключ Тогда
				Склад = СтрокаОчереди.Склад;
				ВидЦены = СтрокаОчереди.ВидЦены;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(Склад) Или НЕ ЗначениеЗаполнено(ВидЦены) Тогда
			Продолжить;
		КонецЕсли;
		
		Цены = StockAPI_Цены.ЗагрузитьЦеныПродажи(КлючИЗначение.Значение, ВидЦены, Склад);
		
		Для Каждого КлючЦены Из Цены Цикл
			Результат.Вставить(КлючТовараWebHook(КлючЦены.Ключ, Склад, ВидЦены), КлючЦены.Значение);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЭлементСообщенияWebHook(СтрокаОчереди, ТипСобытия, ДанныеОбогащения)
	
	Если ТипСобытия = Перечисления.ТипыСобытийWebHooks.СтатусЗаказа Тогда
		Возврат ЭлементСтатусаWebHook(СтрокаОчереди);
	КонецЕсли;
	
	Элемент = Новый Структура;
	Элемент.Вставить("eventId", Строка(СтрокаОчереди.ИД));
	Элемент.Вставить("createdAt", ДатаВСтроку(СтрокаОчереди.Создан));
	
	Если ЗначениеЗаполнено(СтрокаОчереди.Номенклатура) Тогда
		Элемент.Вставить("itemCode", Формат(СтрокаОчереди.Номенклатура.Код, "ЧГ=0"));
		Элемент.Вставить("item", Строка(СтрокаОчереди.Номенклатура));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаОчереди.Склад) Тогда
		Элемент.Вставить("warehouse", Формат(СтрокаОчереди.Склад.Код, "ЧГ=0"));
		Элемент.Вставить("warehouseName", Строка(СтрокаОчереди.Склад));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаОчереди.ВидЦены) Тогда
		Элемент.Вставить("priceType", Строка(СтрокаОчереди.ВидЦены));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаОчереди.Инициатор) Тогда
		Элемент.Вставить("source", Строка(СтрокаОчереди.Инициатор));
	КонецЕсли;
	
	Если ТипСобытия = Перечисления.ТипыСобытийWebHooks.Остаток И ДанныеОбогащения <> Неопределено Тогда
		ДанныеОстатка = ДанныеОбогащения.Получить(КлючТовараWebHook(СтрокаОчереди.Номенклатура, СтрокаОчереди.Склад));
		Если ДанныеОстатка <> Неопределено Тогда
			Элемент.Вставить("balance", ДанныеОстатка.balance);
			Элемент.Вставить("reserve", ДанныеОстатка.reserve);
		КонецЕсли;
	ИначеЕсли ТипСобытия = Перечисления.ТипыСобытийWebHooks.Цена И ДанныеОбогащения <> Неопределено Тогда
		ДанныеЦены = ДанныеОбогащения.Получить(КлючТовараWebHook(СтрокаОчереди.Номенклатура, СтрокаОчереди.Склад, СтрокаОчереди.ВидЦены));
		Если ДанныеЦены <> Неопределено Тогда
			Элемент.Вставить("price", ЦеныWebHookИзДанныхРегистра(ДанныеЦены));
			Элемент.Вставить("currency", ДанныеЦены.Валюта);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Элемент;
	
КонецФункции

Функция ЦеныWebHookИзДанныхРегистра(ДанныеЦены)
	
	МассивЦен = Новый Массив;
	
	Если ДанныеЦены.Цена0 <> 0 Тогда
		Запись = Новый Структура("qty,price", 1, ДанныеЦены.Цена0);
		МассивЦен.Добавить(Запись);
	КонецЕсли;
	
	Если ДанныеЦены.Порог1 <> 0 И ДанныеЦены.Цена1 <> 0 Тогда
		Запись = Новый Структура("qty,price", ДанныеЦены.Порог1, ДанныеЦены.Цена1);
		МассивЦен.Добавить(Запись);
	КонецЕсли;
	
	Если ДанныеЦены.Порог2 <> 0 И ДанныеЦены.Цена2 <> 0 Тогда
		Запись = Новый Структура("qty,price", ДанныеЦены.Порог2, ДанныеЦены.Цена2);
		МассивЦен.Добавить(Запись);
	КонецЕсли;
	
	Если ДанныеЦены.Порог3 <> 0 И ДанныеЦены.Цена3 <> 0 Тогда
		Запись = Новый Структура("qty,price", ДанныеЦены.Порог3, ДанныеЦены.Цена3);
		МассивЦен.Добавить(Запись);
	КонецЕсли;
	
	Возврат МассивЦен;
	
КонецФункции

Функция ЭлементСтатусаWebHook(СтрокаОчереди)
	
	Элемент = Новый Структура;
	Элемент.Вставить("eventId", Строка(СтрокаОчереди.ИД));
	Элемент.Вставить("createdAt", ДатаВСтроку(СтрокаОчереди.Создан));
	
	Если ЗначениеЗаполнено(СтрокаОчереди.Инициатор) Тогда
		Элемент.Вставить("source", Строка(СтрокаОчереди.Инициатор));
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаОчереди.Заказ) Тогда
		Возврат Элемент;
	КонецЕсли;
	
	РеквизитыЗаказа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаОчереди.Заказ, "Номер,НомерВходящий");
	Элемент.Вставить("orderNumber", РеквизитыЗаказа.Номер);
	Элемент.Вставить("incomingNumber", РеквизитыЗаказа.НомерВходящий);
	
	Статус = РаботаСИнвойсами.ПолучитьСтатусИнвойсаПродажи(СтрокаОчереди.Заказ);
	Элемент.Вставить("status", Строка(Статус.Состояние));
	Элемент.Вставить("statusSetBy", Строка(Статус.КемИзменено));
	Элемент.Вставить("statusDate", ДатаВСтроку(Статус.Зарегистрировано));
	
	Возврат Элемент;
	
КонецФункции

Функция ТелоСообщенияWebHook(СтрокаОчереди)
	
	// Совместимость: один элемент в формате пакета.
	Пакет = Новый Структура("ТипСобытия,Строки,МинСоздан", СтрокаОчереди.ТипСобытия, Новый Массив, СтрокаОчереди.Создан);
	Пакет.Строки.Добавить(СтрокаОчереди);
	Возврат ТелоПакетаWebHook(Пакет);
	
КонецФункции

Функция ОтправитьPOSTWebHook(URL, ТелоJSON, Токен)
	
	ДанныеURL = РазобратьURLWebHook(URL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Заголовки.Вставить("Accept", "application/json");
	Если ЗначениеЗаполнено(Токен) Тогда
		//Заголовки.Вставить("X-Webhook-Token", Строка(Токен));
		Заголовки.Вставить("Authorization", "Bearer " + Строка(Токен));
	КонецЕсли;
	
	Если ДанныеURL.HTTPS Тогда
		Соединение = Новый HTTPСоединение(ДанныеURL.Сервер, ДанныеURL.Порт, , , , , Новый ЗащищенноеСоединениеOpenSSL());
	Иначе
		Соединение = Новый HTTPСоединение(ДанныеURL.Сервер, ДанныеURL.Порт);
	КонецЕсли;
	
	ЗапросHTTP = Новый HTTPЗапрос(ДанныеURL.Адрес, Заголовки);
	ЗапросHTTP.УстановитьТелоИзСтроки(ТелоJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Ответ = Соединение.ВызватьHTTPМетод("POST", ЗапросHTTP);
	
	Возврат Новый Структура("КодСостояния,ТелоОтвета", Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
	
КонецФункции

Функция РазобратьURLWebHook(URL)
	
	СтрокаURL = СокрЛП(Строка(URL));
	НижнийURL = НРег(СтрокаURL);
	
	Если СтрНачинаетсяС(НижнийURL, "https://") Тогда
		HTTPS = Истина;
		БезСхемы = Сред(СтрокаURL, 9);
		Порт = 443;
	ИначеЕсли СтрНачинаетсяС(НижнийURL, "http://") Тогда
		HTTPS = Ложь;
		БезСхемы = Сред(СтрокаURL, 8);
		Порт = 80;
	Иначе
		ВызватьИсключение "WebhookURL должен начинаться с http:// или https://.";
	КонецЕсли;
	
	ПозицияПути = СтрНайти(БезСхемы, "/");
	Если ПозицияПути = 0 Тогда
		Хост = БезСхемы;
		Адрес = "/";
	Иначе
		Хост = Лев(БезСхемы, ПозицияПути - 1);
		Адрес = Сред(БезСхемы, ПозицияПути);
	КонецЕсли;
	
	ПозицияПорта = СтрНайти(Хост, ":");
	Если ПозицияПорта > 0 Тогда
		Порт = Число(Сред(Хост, ПозицияПорта + 1));
		Хост = Лев(Хост, ПозицияПорта - 1);
	КонецЕсли;
	
	Если Хост = "" Тогда
		ВызватьИсключение "В WebhookURL не указан сервер.";
	КонецЕсли;
	
	Возврат Новый Структура("HTTPS,Сервер,Порт,Адрес", HTTPS, Хост, Порт, Адрес);
	
КонецФункции

Процедура ЗаписатьРезультатОтправкиПакетаWebHook(СтрокиПакета, ДатаПопытки, Отправлено, ТекстОшибки)
	
	Для Каждого СтрокаОчереди Из СтрокиПакета Цикл
		ЗаписатьРезультатОтправкиWebHook(СтрокаОчереди, ДатаПопытки, Отправлено, ТекстОшибки);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьРезультатОтправкиWebHook(СтрокаОчереди, ДатаПопытки, Отправлено, ТекстОшибки)
	
	НаборЗаписей = РегистрыСведений.ОчередьWebHook.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИД.Установить(СтрокаОчереди.ИД);
	НаборЗаписей.Отбор.УчетнаяЗапись.Установить(СтрокаОчереди.УчетнаяЗапись);
	НаборЗаписей.Отбор.ТипСобытия.Установить(СтрокаОчереди.ТипСобытия);
	НаборЗаписей.Отбор.Номенклатура.Установить(СтрокаОчереди.Номенклатура);
	НаборЗаписей.Отбор.Склад.Установить(СтрокаОчереди.Склад);
	НаборЗаписей.Отбор.ВидЦены.Установить(СтрокаОчереди.ВидЦены);
	НаборЗаписей.Отбор.Заказ.Установить(СтрокаОчереди.Заказ);
	
	Запись = НаборЗаписей.Добавить();
	Запись.ИД 				= СтрокаОчереди.ИД;
	Запись.УчетнаяЗапись 	= СтрокаОчереди.УчетнаяЗапись;
	Запись.ТипСобытия 		= СтрокаОчереди.ТипСобытия;
	Запись.Номенклатура 	= СтрокаОчереди.Номенклатура;
	Запись.Склад 			= СтрокаОчереди.Склад;
	Запись.ВидЦены 			= СтрокаОчереди.ВидЦены;
	Запись.Заказ 			= СтрокаОчереди.Заказ;
	Запись.Отправлен 		= ?(Отправлено, ДатаПопытки, СтрокаОчереди.Отправлен);
	Запись.Создан 			= СтрокаОчереди.Создан;
	Запись.Инициатор 		= СтрокаОчереди.Инициатор;
	Запись.КоличествоПопыток = СтрокаОчереди.КоличествоПопыток + 1;
	Запись.ПоследняяПопытка = ДатаПопытки;
	Запись.Ошибка 			= ?(Отправлено, "", Лев(ТекстОшибки, 500));
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти


// Вспомогательная функция для JSON
//
Функция СтруктураВJSON(Значение)
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

// Безопасно удаляет свойства из СтруктурыЗначений по их именам
// 
// Параметры:
//  СтруктураДанных - Структура
//  ИменаПолей - Строка - имена, разделенные запятой
//
Процедура УдалитьСвойства(СтруктураДанных, ИменаПолей) Экспорт
	
	Если ТипЗнч(СтруктураДанных) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;  
	
	массивИмен = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаПолей, ",", Истина);	
    Для каждого Имя Из массивИмен Цикл
		Если СтруктураДанных.Свойство(Имя) Тогда
			СтруктураДанных.Удалить(Имя);
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры 

// © Primus1C  ОКОНЧАНИЕ ◄
